# IMDB Data Project
Craig Gossen

**This project is to analyze what makes a movie successful and provide recommendations to the stakeholder on how to make a successful movie.** 

This portion constructs and exports a MySQL database using the IMDB data.

# Load and Create Tables

In [1]:
#Imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
username = 'root'
password = 'root'
db_name = 'movies'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}' #format is  dialect+driver://username:password@host:port/database
engine = create_engine(connection) 
engine #to verify engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

### Loading and cleaning the tmdb_data table

In [54]:
#Load data
api_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
api_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.113,2102.0,PG

In [58]:
#Dropping all but the selected columns
tmdb_data= api_df[['imdb_id', 'revenue', 'budget', 'certification']]

#Rename column
tmdb_data = tmdb_data.rename(columns={"imdb_id": "tconst"})

tmdb_data.head()

      tconst     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

**tmdb_data table created**

### Loading and cleaning the ratings dataframe

In [6]:
#Load other data
title_ratings = pd.read_csv('Data/inprocess_ratings.csv.gz', low_memory=False)

title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1947
1  tt0000002            5.8       264
2  tt0000005            6.2      2580
3  tt0000006            5.1       177
4  tt0000007            5.4       810

**title_ratings table created**

### Loading and cleaning the titles_basics, titles_genres and genres tables

In [68]:
#Load other data
titles = pd.read_csv('Data/inprocess_titles.csv.gz', low_memory=False)
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [69]:
## create a col with a list of genres
titles['genres_split'] = titles['genres'].str.split(',')
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]

In [70]:
#Explode the genres_split column
exploded_genres = titles.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
84807,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
84807,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
84807,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
84808,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
84808,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [71]:
#Create titles_basics table
title_basics = exploded_genres[['tconst', 'primaryTitle','startYear', 'runtimeMinutes']] ##, 'genres_split']]
#title_basics = title_basics.rename(columns={'genres_split':'genres'})
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
0,tt0035423,Kate & Leopold,2001,118
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122

**titles_basics table created**

In [11]:
#creating unique genre table
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [12]:
#Creating title_genres table 
titles_genres = exploded_genres[['tconst','genres_split']].copy()
titles_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [13]:
#Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
titles_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [15]:
print(type(titles_genres['genres_split'][0]))

<class 'pandas.core.series.Series'>

In [16]:
#Replace the string genres with the integer ids to create title_genres table
titles_genres['genre_id'] = titles_genres['genres_split'].map(genre_map)
titles_genres = titles_genres.drop(columns = 'genres_split')

In [17]:
titles_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

**titles_genres table created**

In [18]:
#Make a new dataframe with genre_name and genre_id
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**genres table created**

# Setting MySQL Schema (Data types and Primary Keys)

### title_basics table

In [72]:
title_basics.head(2)

      tconst    primaryTitle  startYear  runtimeMinutes
0  tt0035423  Kate & Leopold       2001             118
0  tt0035423  Kate & Leopold       2001             118

In [73]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158473 entries, 0 to 84808
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          158473 non-null  object
 1   primaryTitle    158473 non-null  object
 2   startYear       158473 non-null  int64
 3   runtimeMinutes  158473 non-null  int64
dtypes: int64(2), object(2)
memory usage: 6.0+ MB

In [74]:
#Set length to n+1 for primary key in table
from sqlalchemy.types import*
#Determine max string length for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

print(f'key length = {key_len}\ntitle length = {title_len}')

key length = 10
title length = 242

In [75]:
#Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear": Integer(),
    "runtimeMinutes": Integer()}

df_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Integer(),
 'runtimeMinutes': Integer()}

In [76]:
#Save to sql with dtype and index = False
title_basics.to_sql('title_basics', engine, dtype = df_schema, if_exists = 'replace', index = 'False')

158473

In [77]:
#Run query to add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (tconst)')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry 'tt0244316' for key 'title_basics.PRIMARY'")
[SQL: ALTER TABLE title_basics ADD PRIMARY KEY (tconst)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [25]:
sql = """
SELECT *   
FROM  title_basics
LIMIT 5
;
"""
pd.read_sql_query(sql, engine)

,False,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,0,tt0035423,Kate & Leopold,2001,None,118
1,0,tt0035423,Kate & Leopold,2001,None,118
2,0,tt0035423,Kate & Leopold,2001,None,118
3,1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
4,2,tt0069049,The Other Side of the Wind,2018,None,122

### title_ratings table

In [26]:
title_ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1947
1  tt0000002            5.8       264

In [27]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 486816 entries, 0 to 486815
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         486816 non-null  object
 1   averageRating  486816 non-null  float64
 2   numVotes       486816 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.1+ MB

In [28]:
type(title_ratings['tconst'][1])

str

In [29]:
#Set length to n+1 for primary key in table
#Determine max string length for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

print(f'key length = {key_len}')

key length = 10

In [30]:
#Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    "numVotes": Integer()}

df_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [31]:
#Save to sql with dtype and index = False
title_ratings.to_sql('title_ratings', engine, dtype = df_schema, if_exists = 'replace', index = 'False')

486816

In [32]:
#Run query to add primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (tconst)')

In [33]:
sql = """
SELECT *   
FROM  title_ratings
LIMIT 5
;
"""
pd.read_sql_query(sql, engine)

   False     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1947
1      1  tt0000002            5.8       264
2      2  tt0000005            6.2      2580
3      3  tt0000006            5.1       177
4      4  tt0000007            5.4       810

### tmdb_data table

In [59]:
tmdb_data.head(2)

      tconst  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN

In [61]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2518 entries, 0 to 2517
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         2518 non-null   object
 1   revenue        2516 non-null   float64
 2   budget         2516 non-null   float64
 3   certification  802 non-null    object
dtypes: float64(2), object(2)
memory usage: 78.8+ KB

In [62]:
#Set length to n+1 for primary key in table
from sqlalchemy.types import*
#Determine max string length for object columns
key_len = tmdb_data['tconst'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()

print(f'key length = {key_len}\ntitle length = {title_len}')

key length = 10
title length = 7

In [63]:
#Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),
    "certification": Text(title_len+1),
    "revenue": Float(),
    "budget": Float()}

df_schema

{'tconst': String(length=11),
 'certification': Text(length=8),
 'revenue': Float(),
 'budget': Float()}

In [64]:
#Save to sql with dtype and index = False
tmdb_data.to_sql('tmdb_data', engine, dtype = df_schema, if_exists = 'replace', index = 'False')

2518

In [65]:
#Run query to add primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (tconst)')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '0' for key 'tmdb_data.PRIMARY'")
[SQL: ALTER TABLE tmdb_data ADD PRIMARY KEY (tconst)]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [66]:
sql = """
SELECT *   
FROM  tmdb_data
LIMIT 5
;
"""
pd.read_sql_query(sql, engine)

   False     tconst     revenue      budget certification
0      0          0         NaN         NaN          None
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694  12855000.0    150000.0            PG

### genres table

In [41]:
genres.head(2)

  genre_name  genre_id
0     Action         0
1      Adult         1

In [42]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [43]:
#Set length to n+1 for primary key in table
from sqlalchemy.types import*
#Determine max string length for object columns
key_len = genres['genre_name'].fillna('').map(len).max()

print(f'key length = {key_len}')

key length = 10

In [44]:
#Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1),
    "genre_id": Integer()}

df_schema

{'genre_name': String(length=11), 'genre_id': Integer()}

In [45]:
#Save to sql with dtype and index = False
genres.to_sql('genres', engine, dtype = df_schema, if_exists = 'replace', index = 'False')

26

In [46]:
#Run query to add primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (genre_name)')

In [47]:
sql = """
SELECT *   
FROM  genres
LIMIT 5
;
"""
pd.read_sql_query(sql, engine)

   False genre_name  genre_id
0      0     Action         0
1      1      Adult         1
2      2  Adventure         2
3      3  Animation         3
4      4  Biography         4

### title_genres table

In [48]:
titles_genres.head(2)

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9

In [49]:
titles_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158473 entries, 0 to 84808
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    158473 non-null  object
 1   genre_id  158473 non-null  int64
dtypes: int64(1), object(1)
memory usage: 7.7+ MB

In [50]:
#Set length to n+1 for primary key in table
from sqlalchemy.types import*
#Determine max string length for object columns
key_len = titles_genres['tconst'].fillna('').map(len).max()

print(f'key length = {key_len}')

key length = 10

In [51]:
#Create schema dictionary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1),
    "genre_id": Integer()}

df_schema

{'tconst': String(length=11), 'genre_id': Integer()}

In [52]:
#Save to sql with dtype and index = False
titles_genres.to_sql('titles_genres', engine, dtype = df_schema, if_exists = 'replace', index = 'False')

158473

titles_genres is a joiner table and no primary key is needed

In [53]:
sql = """
SELECT *   
FROM  titles_genres
LIMIT 5
;
"""
pd.read_sql_query(sql, engine)

   False     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0069049         7

In [67]:
sql = """
SHOW TABLES
;
"""
pd.read_sql_query(sql, engine)

  Tables_in_movies
0           genres
1     title_basics
2    title_ratings
3    titles_genres
4        tmdb_data